package leetcode.editor.cn;

//给你一个整数 n ，共有编号从 0 到 n - 1 的 n 个会议室。 
//
// 给你一个二维整数数组 meetings ，其中 meetings[i] = [starti, endi] 表示一场会议将会在 半闭 时间区间 [
//starti, endi) 举办。所有 starti 的值 互不相同 。 
//
// 会议将会按以下方式分配给会议室： 
//
// 
// 每场会议都会在未占用且编号 最小 的会议室举办。 
// 如果没有可用的会议室，会议将会延期，直到存在空闲的会议室。延期会议的持续时间和原会议持续时间 相同 。 
// 当会议室处于未占用状态时，将会优先提供给原 开始 时间更早的会议。 
// 
//
// 返回举办最多次会议的房间 编号 。如果存在多个房间满足此条件，则返回编号 最小 的房间。 
//
// 半闭区间 [a, b) 是 a 和 b 之间的区间，包括 a 但 不包括 b 。 
//
// 
//
// 示例 1： 
//
// 输入：n = 2, meetings = [[0,10],[1,5],[2,7],[3,4]]
//输出：0
//解释：
//- 在时间 0 ，两个会议室都未占用，第一场会议在会议室 0 举办。
//- 在时间 1 ，只有会议室 1 未占用，第二场会议在会议室 1 举办。
//- 在时间 2 ，两个会议室都被占用，第三场会议延期举办。
//- 在时间 3 ，两个会议室都被占用，第四场会议延期举办。
//- 在时间 5 ，会议室 1 的会议结束。第三场会议在会议室 1 举办，时间周期为 [5,10) 。
//- 在时间 10 ，两个会议室的会议都结束。第四场会议在会议室 0 举办，时间周期为 [10,11) 。
//会议室 0 和会议室 1 都举办了 2 场会议，所以返回 0 。 
// 
//
// 示例 2： 
//
// 输入：n = 3, meetings = [[1,20],[2,10],[3,5],[4,9],[6,8]]
//输出：1
//解释：
//- 在时间 1 ，所有三个会议室都未占用，第一场会议在会议室 0 举办。
//- 在时间 2 ，会议室 1 和 2 未占用，第二场会议在会议室 1 举办。
//- 在时间 3 ，只有会议室 2 未占用，第三场会议在会议室 2 举办。
//- 在时间 4 ，所有三个会议室都被占用，第四场会议延期举办。 
//- 在时间 5 ，会议室 2 的会议结束。第四场会议在会议室 2 举办，时间周期为 [5,10) 。
//- 在时间 6 ，所有三个会议室都被占用，第五场会议延期举办。 
//- 在时间 10 ，会议室 1 和 2 的会议结束。第五场会议在会议室 1 举办，时间周期为 [10,12) 。 
//会议室 1 和会议室 2 都举办了 2 场会议，所以返回 1 。 
// 
//
// 
//
// 提示： 
//
// 
// 1 <= n <= 100 
// 1 <= meetings.length <= 10⁵ 
// meetings[i].length == 2 
// 0 <= starti < endi <= 5 * 10⁵ 
// starti 的所有值 互不相同 
// 
//
// 👍 10 👎 0

import java.util.Arrays;
import java.util.PriorityQueue;
import java.util.TreeSet;

public class MeetingRoomsIii{
         public static void main(String[] args) {
            Solution solution = new MeetingRoomsIii().new Solution();
            //[[0,10],[1,5],[2,7],[3,4]]
             System.out.println(solution.mostBooked(3,new int[][]{{0,10},{1,5},{2,7},{3,4}}));
 }

//leetcode submit region begin(Prohibit modification and deletion)
class Solution {
    private class Pair<K, V> {
        public K first;
        public V second;
        public Pair(K first, V second) {
            this.first = first;
            this.second = second;
        }
    }

    public int mostBooked(int n, int[][] meetings) {
        // 按开始时间排序
        Arrays.sort(meetings, (x, y) -> x[0] - y[0]);
        int[] count = new int[n];
        // TreeSet 记录此时所有可用的会议室（也可以用 PriorityQueue）
        TreeSet<Integer> meetingRoom = new TreeSet<>();
        for (int i = 0; i < n; i++)
            meetingRoom.add(i);
        // 优先队列记录 {结束时间，占用的会议室}，优先按照结束时间排序
        PriorityQueue<Pair<Long, Integer>> heap = new PriorityQueue<>((x, y) -> Long.compare(x.first, y.first) == 0 ? x.second - y.second : Long.compare(x.first, y.first));
        // 顺序遍历会议室，先遍历到的肯定是开始时间早的
        for (int[] meeting : meetings) {
            // 如果有结束时间早于当前会议开始时间的会议，都先弹出优先队列（不会对后面的会议造成影响）
            while (!heap.isEmpty() && meeting[0] >= heap.peek().first)
                meetingRoom.add(heap.poll().second);
            // 如果 TreeSet 中获取不到空的会议室，就弹出最早结束的会议把会议室腾出来，但是结束时间要设置为"弹出会议的结束时间 + 当前会议的持续时间"，因为要等待会议结束
            if (meetingRoom.isEmpty()) {
                Pair<Long, Integer> cur = heap.poll();
                count[cur.second]++;
                heap.offer(new Pair<>(cur.first + (long) meeting[1] - meeting[0], cur.second));
            }
            // 有空会议室直接分配即可
            else {
                int get = meetingRoom.first();
                heap.offer(new Pair<>((long) meeting[1], get));
                count[get]++;
                meetingRoom.remove(get);
            }
        }
        // 最后计算最大的会议室下标
        int max = 0;
        for (int i = 1; i < n; i++)
            if (count[max] < count[i])
                max = i;
        return max;
    }
}


//leetcode submit region end(Prohibit modification and deletion)

}
